1; // 1
0.3 - // 0.3
2; // -2
50000; // 50000
5e4; // 50000
0.0005; // 0.0005
5e-4; // 0.0005
1000000000000000 // 1000000000000000
1_000_000_000_000_000 // 1000000000000000
// 그외 진법도 쓸 수 있다...

typeof NaN // "number"
"바나나" - "사과" // NaN (Not a Number)

Number("123") // 123
Number("3월") // NaN

parseInt("123") // 123 (진법 계산 해줌) 
// parseInt('계산할 식',진수 기본 = 10진법)
parseFloat("3월") // 3
parseInt("3.14") // 3 (정수로 바꿈) 
parseFloat("3.14") // 3.14 (소수로 바꿈) 

typeof "123" // string
typeof parseInt("123") //number